expression = input('Введите арифметическое выражение: ')
print(f'Результат вычисления заданного арифметического выражения равен: '
      f'{eval(expression)}')